import static org.junit.Assert.*;

import org.junit.Test;


public class Homework_2Test {

	//====================================================================
	//1)найти сумму четных чисел и их количество в диапазоне от 1 до 99
	//====================================================================
	@Test
	public void test_100_1() 
	{
		int act = Homework_2.hw_1_sum(100);
		assertEquals(2450,act);
	}

	@Test
	public void test_100_2() 
	{
		int act = Homework_2.hw_1_count(100);
		assertEquals(50, act);
	}
	//====================================================================
	//2) Проверить простое ли число?
	//====================================================================
	@Test
	public void test_simple() 
	{
		int act = Homework_2.hw_2(7);
		assertEquals(1,act);
	}
	//====================================================================
	//3) Найти корень натурального числа с точностью до целого
	//====================================================================
	@Test
	public void test_sqrt() {
		int act = Homework_2.hw_3(4);
		assertEquals(2,act);			
	}
	//====================================================================
	//4) Вычислить факториал числа
	//====================================================================
	@Test
	public void test_factorial() {
		int act = Homework_2.hw_4(5);
		assertEquals(120,act);
	}
	//====================================================================
	//5) Посчитать сумму цифр заданного числа
	//====================================================================
	@Test
	public void test_summ() {
		int act = Homework_2.hw_5(123);
		assertEquals(6,act);
	}
	//====================================================================
	//6) Вывести число, которое является зеркальным отображением 
	//последовательности цифр заданного числа
	//====================================================================

}
