
public class Homework_4 
{
	//================================================================
	//1) Написать функцию, которая возвращает 
	//строковое название дня недели по номеру дня.
	//================================================================
	public static String hw_1 (int a)
	{
		String res="";

		switch (a) 
		{
		case 1:  res="Sunday";
		break;
		case 2:  res="Monday";
		break;
		case 3:  res="Tuesday";
		break;
		case 4:  res="Thursday";
		break;
		case 5:  res="Wednesday";
		break;
		case 6:  res="Friday";
		break;
		case 7:  res="Saturday";
		break;
		default: res =  "We dont have other days";
		break;


		}
		return res;
	}
	
	//================================================================
	//2) Написать программу, которая выведет число N (от 0 до 1000), 
	//написанное прописью.
	//================================================================
	
	
	//================================================================
	//3) Написать функцию, которая находит расстояние 
	//между двумя точками в двумерном декартовом пространстве.
	//================================================================
	public static int hw_3(int x1, int y1, int x2, int y2 )
	{
		int res =(int)Math.sqrt(Math.pow((x2-x1),2)+Math.pow((y2-y1),2));
		return res;
	}
}
