
public class Homework_3 
{
	//================================================================
	//1) Найти минимальный элемент массива
	//================================================================
	public static int hw_1 (int [] arr)
	{
		int min=arr[0];
		for (int i=0;i<arr.length;i++)
		{
			if (min>arr[i])
			{
				min=arr[i];
			}
		}
		return min;
	}

	//================================================================
	//2) Найти индекс максимального элемента массива
	//================================================================
	public static int hw_2 (int [] arr)
	{
		int max=arr[0];
		int index=0;
		for (int i=0;i<arr.length;i++)
		{			
			if (max<arr[i])
			{
				max=arr[i];
				index=i;
			}
		}
		return index;
	}
	//================================================================
	//3)Посчитать сумму элементов массива с нечетными индексами
	//================================================================
	public static int hw_3 (int [] arr)
	{
		int res=0;
		for (int i=0;i<arr.length;i++)
		{			
			if (arr[i]%2!=0)
			{
				res+=arr[i];
			}
		}
		return res;
	}
	//================================================================
	//4)Сделать реверс массива (массив в обратном направлении)
	//================================================================
	public static int[] hw_4 (int [] a)
	{
		int [] b = new int [a.length];
		for (int i=0;i<a.length;i++)
		{
			b[i]=a[a.length-1-i];
		}
		return b;		
	}
	//================================================================
	//5) Посчитать количество нечетных элементов массива
	//================================================================
	public static int hw_5 (int [] a)
	{
		int res=0;
		for (int i=0;i<a.length;i++)
		{			
			if (a[i]%2!=0)
			{
				res++;
			}
		}
		return res;
	}
	//================================================================
	//7) Отсортировать массив выбором
	//================================================================
	public static int [] selection (int [] a)
	{
		for (int i = 0; i < a.length; i++) {
			int min = a[i]; 
			int imin = i; 

			for (int j = i+1; j < a.length; j++) {

				if (a[j] < min) {
					min = a[j];
					imin = j;
				}
			}

			if (i != imin) {
				int temp = a[i];
				a[i] = a[imin];
				a[imin] = temp;
			}
		}
		return a;
	}
	//================================================================
	//7) Отсортировать массив пузырьком
	//================================================================
	public static int[] bubble (int [] a)
	{
		for(int i=0;i<a.length-1;i++)
		{
			for(int j=i+1;j<a.length;j++)
			{
				if(a[i]>a[j])
				{
					int tmp=a[i];
					a[i]=a[j];
					a[j]=tmp;
				}
			}
		}
		return a;
	}
	//================================================================
	//7) Отсортировать массив вставками
	//================================================================
	public static int [] another (int [] a)
	{
		for (int i = 0; i < a.length; i++)
		{
			int temp = a[i];
			int j =i-1; 
			while(j >= 0 && a[j] > temp)

			{
				a[j + 1] = a[j];

				j--;
			}
			a[j + 1] = temp;
		}
		return a;
	}
}
