import static org.junit.Assert.*;

import org.junit.Test;


public class Homework_MathTest 
{

	//===========================================================================
	//2. Скорость первого автомобиля v1 км/ч, второго — v2 км/ч, расстояние 
	//между ними s км. Какое расстояние будет между ними через t ч, если
	//автомобили движутся в разные стороны?
	//===========================================================================		

	@Test
	public void test_hw_cars() {
		int act = Homework_Math.hw_3(100, 100, 100, 1);
		assertEquals(300, act);
	}

	//=====================================================================
	//3. Записать логическое выражение, принимающее значение 1, если точка 
	//лежит внутри заштрихованной области, иначе — 0.
	//=====================================================================
	@Test
	public void test_hw_coord() 
	{
		int act = Homework_Math.hw_4(1,2);
		assertEquals(0,act);
	}

}
